# IsDefault Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PhaseFilter..::..IsDefault Property
PhaseFilter Class See Also
---
Indicates whether this filter is the default one.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsDefault { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsDefault As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsDefault {
	bool get ();
}
```

# See Also
PhaseFilter Class
Autodesk.Revit.DB Namespace